Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་འདོད་ཆགས་དང་བྲལ་བར་འགྱུར་བའོ། །
en: This vajra statement removes attachment.

source: བྱམས་པའི་མཐའ་དང་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་ཞེ་སྡང་གི་མཐའ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: Limit of aggression is a vajra statement because it is equal to the limit of love.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་ཞེ་སྡང་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པར་འགྱུར་བའོ། །
en: This vajra statement defeats all aggression.

source: ཤེས་རབ་ཀྱི་སྣང་བ་དང་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་གཏི་མུག་གི་མཐའ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: Limit of stupidity is a vajra statement because it is equal to the light of insight.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་མུན་པ་མེད་ཅིང་སྣང་བར་འགྱུར་བའོ། །
en: This vajra statement clears away darkness and illuminates.

source: སེམས་ཅན་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་འཇུག་པའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་སེམས་ཅན་གཅིག་པ་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All beings are the same being is a vajra statement because it relates to the sameness of all beings.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རྗེས་སུ་རྟོགས་པར་འགྱུར་བའོ། །
en: This vajra statement realizes the essential nature of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་མཉམ་པ་ཉིད་ལ་འཇུག་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྣམས་སེམས་གཅིག་པ་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: The minds of all beings are the same mind is a vajra statement because it shows the sameness of the minds of all beings.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་སེམས་རང་བཞིན་གྱིས་འོད་གསལ་བར་རྗེས་སུ་རྟོགས་པར་འགྱུར་བའོ། །
en: This vajra statement realizes that the mind is luminous by nature.

source: དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་ལ་འཇུག་པའི་ཕྱིར་སངས་རྒྱས་ཐམས་ཅད་སངས་རྒྱས་གཅིག་པ་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All buddhas are the same buddha is a vajra statement because it relates to suchness and sameness.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་རྟོགས་པར་འགྱུར་བའོ། །
en: This vajra statement realizes the wisdom of sameness.

source: ཞིང་མི་ཟད་པ་ལ་འཇུག་པའི་ཕྱིར་ཞིང་ཐམས་ཅད་ཞིང་གཅིག་པ་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All buddha realms are a single realm is a vajra statement because it relates to the inexhaustibility of realms.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་ནམ་མཁའ་དང་མཉམ་པ་ཉིད་དེ་རྗེས་སུ་རྟོགས་པར་འགྱུར་བའོ། །
en: This vajra statement realizes their sameness of space.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་འཇུག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་གཅིག་པ་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All phenomena are the same is a vajra statement because it relates to the sameness of all phenomena.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་རྗེས་སུ་རྟོགས་པར་འགྱུར་བའོ། །
en: This vajra statement realizes the entryway of the nondual Dharma.

source: ཐམས་ཅད་དུ་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འགྲོ་བ་ལ་འཇུག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All phenomena are qualities of buddhahood is a vajra statement because it relates to the wisdom that engages everything.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་རྗེས་སུ་རྟོགས་པར་འགྱུར་བའོ། །
en: This vajra statement realizes the vajra-like absorption.

source: བདུད་ཀྱི་ལས་རྗེས་སུ་རྟོགས་པ་ལ་འཇུག་པའི་ཕྱིར་ལས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All actions are buddha activity is a vajra statement because it creates an understanding of the activity of the māras.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་བདུད་ཀྱི་ལས་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདའ་བར་འགྱུར་བའོ། །
en: This vajra statement transcends all the māras’ activity.

source: སྐད་ཐམས་ཅད་རྗེས་སུ་རྟོགས་པ་ལ་འཇུག་པའི་ཕྱིར་ཚིག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་གསུང་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All words are the speech of the thus-gone ones is a vajra statement because it creates an understanding of all language.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་ཆོས་བརྗོད་དུ་མེད་པར་རྟོགས་པར་འགྱུར་བའོ། །
en: This vajra statement realizes the inexpressible Dharma.

source: འཆི་འཕོ་མེད་པ་ལ་འཇུག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All phenomena are unborn is a vajra statement because it shows the deathless state.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་སྐྱེ་བ་དང་རྒ་བ་དང་ན་བ་དང་འཆི་བའི་ལམ་ལས་ཤིན་ཏུ་འདའ་བར་འགྱུར་བའོ། །
en: This vajra statement transcends the way of birth, aging, sickness, and death.

source: འགོག་པ་མེད་པ་ལ་འཇུག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་མ་བྱུང་བ་འདི་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: All phenomena are nonarising is a vajra statement because it relates to the unceasing state.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་འགག་པ་མེད་པར་འགྱུར་བའོ། །
en: This vajra statement shows the lack of arising and ceasing of all phenomena.

source: བློ་གྲོས་རྒྱ་མཚོ་རྡོ་རྗེའི་ཚིག་དེ་དག་ནི་མི་ཕྱེད་པའི་ཚིག །སྙིང་པོའི་ཚིག །མཉམ་པའི་ཚིག །བདེན་པའི་ཚིག །བརྟན་པའི་ཚིགཐ་དད་པ་མེད་པའི་ཚིག །རྗེས་སུ་འགྲོ་བའི་ཚིག །རྒྱུན་ཆད་པ་མེད་པའི་ཚིག །ཞི་བ་དང་རབ་ཏུ་ཞི་བ་དང་ཉེ་བར་ཞི་བའི་ཚིག །སྐྱོན་དུ་བྱ་བ་མེད་པའི་ཚིག །སྒྲོ་བཏགས་པ་མེད་པའི་ཚིག །འགྲོ་བ་མེད་པ་རྟོག་པ་ལ་འཇུག་པའི་ཚིག །འགྲོ་བ་མེད་པའི་ཚིག །དེ་ཁོ་ནའི་ཚིག །ཡང་དག་པའི་ཚིག །སངས་རྒྱས་དང་མི་འགལ་བའི་ཚིག །ཆོས་མི་སྤོང་བའི་ཚིག །དགེ་འདུན་ཡོངས་སུ་སྡུད་པའི་ཚིག །ཇི་ལྟ་བ་བཞིན་གྱི་ཚིག །འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཚིག །དཔའ་བའི་ཚིག །ཚངས་པའི་ཚིག །གཡོ་བ་མེད་པའི་ཚིག །ནམ་མཁའ་དང་མཉམ་པའི་ཚིག །བྱང་ཆུབ་ཀྱི་རྗེས་སུ་འགྲོ་བའི་ཚིག །མཚན་མ་མེད་པའི་ཚིག །ཆོས་ཀྱི་མཚན་ཉིད་མཚན་ཉིད་མེད་པའི་ཚིག །སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པ་ལ་མི་གནས་པའི་ཚིག །བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པའི་ཚིག །དག་ཅིང་དྲི་མ་མེད་ལ་འོད་གསལ་བའི་ཚིག །བྱང་ཆུབ་ལ་རྣམ་པར་ལྟ་བའི་ཚིག །ཤེས་རབ་ཀྱི་སྣང་བའི་ཚིག །མུན་པ་མེད་ཅིང་བསལ་བའི་ཚིག །ཤིན་ཏུ་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པའི་ཚིག །རང་གི་ཡུལ་ཡོངས་སུ་དག་པའི་ཚིག །སངས་རྒྱས་ཀྱི་ཡུལ་ལ་འཇུག་པའི་ཚིག །མི་རྟོག་ཅིང་རྣམ་པར་མི་རྟོག་ལ་ཡོངས་སུ་མི་རྟོག་པའི་ཚིག །ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་པའི་ཚིག །གནས་མེད་པའི་གནས་ལ་འཇུག་པའི་ཚིག་རྣམས་སོ། །
en: “Sāgaramati, these vajra statements are steadfast words, essential words, equal words, true words, stable words, undifferentiated words, according words, continuous words, peaceful words, soothing words, calming words, unproblematic words, words free from superimposition, words that realize non-movement, words without movement, words of suchness, authentic words, words that do not contradict the Buddha, words that do not discard the Dharma, words that gather the Saṅgha, accurate words, words of the purity of the three spheres, courageous words, Brahmā words, words without fluctuation, space-like words, words that accord with awakening, signless words, words that lack any characteristics of phenomena, words that do not depend on mind, words that do not depend on conceptual mind, words that do not depend on consciousness, words that defeat māras and obstructers, pure words, immaculate words, luminous words, words that behold awakening, words of the light of insight, words that eliminate and dispel darkness, unborn and unceasing words, words that purify their own objects, words that penetrate buddhas’ objects, words that are free from thoughts and concepts, words of the undifferentiated realm of phenomena, and words that enter into the stateless state.

source: བློ་གྲོས་རྒྱ་མཚོ་རྡོ་རྗེའི་ཚིག་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ངེས་པར་རྟོགས་པའི་དོན་དུ་ཁོང་དུ་ཆུད་པ་དེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གནས་ཏེ་སེང་གེའི་ཁྲི་ལ་འདུག་པའོ་ཞེས་ང་སྨྲའོ། །
en: “Sāgaramati, I declare that any bodhisattva who attains a realization of these vajra statements will come to reside at the seat of awakening and sit upon the lion throne.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྒོའི་ཚིག་དང་ཕྱག་རྒྱའི་ཚིག་དང་རྡོ་རྗེའི་ཚིག་འདི་དག་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་གིས་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱའི་སྒོ་ལ་འཇུག་པའི་གཟུངས་ཐོབ་པར་གྱུར་ཏོ། །
en: Once the Blessed One had spoken these entrance words, seal words, and vajra statements, eight thousand bodhisattvas attained the dhāraṇī that enters the gateway of the seal of all phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་མཉམ་པ་ཉིད་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཀྱང་ཐོབ་བོ། །
en: They also attained the absorption called “experiencing the sameness of all beings’ thoughts.”

source: དེ་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་བསྟན་པ་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་སྟེ་ཡི་རངས་ནས་
en: As the bodhisattva great beings, who had assembled from worlds throughout the ten directions, heard this teaching, they were satisfied, happy, and delighted.

source: མངོན་པར་ཤེས་པའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་ནས་ལྷགས་པ་དེ་དག་འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་དང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་མེ་ཏོག་དང་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་ཅི་འདྲ་བ་ཡོད་པ་དེ་འདྲ་བའི་མེ་ཏོག་དང་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དག་གི་ཆར་ཆེན་པོ་མངོན་པར་ཕབ་བོ། །
en: In order to venerate the Blessed One and ensure the longevity of this Dharma teaching, these beings, who had arrived through the miraculous power of their super-knowledge, now brought down a rain of flowers, incense, garlands, and ointments that was just like the flowers, incense, garlands, and ointments found in their respective buddha realms.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་སྒྲ་སྐད་དང་ང་རོ་གཅིག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་པ།
en: Once they had venerated the Blessed One in this way, they praised him in a single voice and in a single roar:

source: གཟུགས་ཀྱི་མཚན་ཉིད་མཚན་གཞི་མེད་གཟིགས་པ། །
en: “You see that the characteristics of form are without basis.

source: མཚན་ཉིད་གཅིག་གིས་མཚན་གཞི་བྲལ་སྟོན་པ། །
en: With a single characteristic you teach the lack of basis for characteristics.

source: མཚན་ཀུན་མཚན་གཞི་མ་མཆིས་མཚན་གཞི་མཉམ། །
en: For you, there is no basis for any designations; all such bases are equal.

source: ཡང་དག་མཚན་གནས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you who uphold the true characteristic!

source: སེམས་ཅན་ཀུན་གྱི་སྐད་དང་སྒྲ་ལ་ཞུགས། །སྐད་ལ་ཞུགས་པའི་ཡེ་ཤེས་དེ་ལའང་ཞུགས། །
en: “You know the languages and sounds of all beings, And you know the wisdom that realizes language.

source: སྒྲ་སྐད་དབྱངས་རྣམས་ཀུན་ལས་རྣམ་པར་གྲོལ། །
en: You are liberated from all sounds, language, and voices.

source: སེམས་གྲོལ་མཉམ་པའི་སེམས་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, whose mind of sameness is liberated!

source: སེམས་ཀྱི་རྒྱུ་བ་རྒྱ་ཆེན་ཅི་མཆིས་པ། །སྒྱུ་མའི་སེམས་དང་མཉམ་ཉིད་ཐུགས་སུ་ཆུད། །
en: “Amidst all the extensive movements of mind You realize the illusory mind and sameness:

source: རབ་ཏུ་མི་རྒྱུ་རྒྱུ་མཉམ་རྒྱུ་མི་མངའ། །
en: Unmoving, motionless, and still.

source: མཁའ་འདྲའི་ཐུགས་དང་ལྡན་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, whose mind is like space!

source: མཆིས་དང་མ་མཆིས་མཐའ་དང་མཐའ་མ་ལགས། །ཆོས་དང་ཆོས་མིན་ཡོངས་རྟོག་རྣམ་རྟོག་མཉམ། །
en: “All your thoughts and concepts about being, non-being, Extremes, no extremes, Dharma, non-Dharma, have become sameness.

source: སེམས་དང་ཡིད་རྣམས་ཐམས་ཅད་ཉེ་བར་ཞི། །
en: All thoughts and mind states are at peace.

source: སེམས་ཡིད་ཞི་བར་གྱུར་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, whose thoughts and mind are at peace!

source: རྒྱུ་དང་རྐྱེན་དང་བྱ་བ་རྣམས་ཀྱང་མཁྱེན། །རྒྱུ་ལས་འབྱུང་བའི་རིམ་པའང་གསུང་བར་མཛད། །
en: “You know cause, condition, and action, And describe the stages that occur from causes.

source: རྒྱུ་དང་རྐྱེན་ནི་རྣམ་གྲོལ་མཐའ་ཡས་ཏེ། །ཡང་དག་མཐའ་དང་མཉམ་པར་རབ་ཏུ་མཁྱེན། །
en: For you, causes and conditions are infinitely liberated, And your knowledge is equal to the limit of reality.

source: འདི་ནི་ཐམས་ཅད་མཉམ་པའི་གཟུགས་སུ་ཞུགས། །བདེ་གཤེགས་སྐུ་ནི་སྐུ་མ་ལགས་པར་མཐོང་། །
en: “This is the realization of the sameness of all forms, And seeing that the body of the Thus-Gone One is not in fact a body.

source: ཁྱོད་ཀྱི་ཐུགས་ནི་རྣམ་རྟོག་མི་འགྱུར་བར། །ཁྱོད་ནི་རྒྱ་ཆེན་གཟུགས་སྟོན་གཟུགས་མ་མཆིས། །
en: Your mind does not conceptualize, And you display vast forms that are not forms.

source: ཕྱོགས་ན་རྒྱལ་བའི་ཞིང་རྣམས་ཇི་སྙེད་པ། །ཞིང་རྣམས་ཐམས་ཅད་ཞིང་འདིར་རབ་ཞུགས་ཀྱང་། །ཞིང་འདིར་རྣམ་པར་འཕེལ་བ་མ་མཆིས་ལ། །
en: “Even if all the victors’ realms Were inserted into this realm, This realm would not need to grow;

source: དེ་ནས་མ་གཡོས་འཕོས་པའང་མཆིས་མ་ལགས། །
en: It would not move or transfer anywhere.

source: སེམས་ཀུན་སེམས་མ་མཆིས་པས་མཉམ་པའི་སེམས། །
en: “Since minds are not minds, mind is the same.

source: སེམས་ནི་སྒྱུ་མར་འགྱུར་དང་རྟོག་མ་མཆིས། །
en: Mind is illusory and nonconceptual.

source: བྱང་ཆུབ་སེམས་ནི་མཉམ་ཉིད་ཐུགས་སུ་ཆུད། །
en: The mind of awakening is the understanding of sameness.

source: དེས་ན་སངས་རྒྱས་མཉམ་པའི་ཆོས་ལ་གནས། །
en: Thus, it resides in the quality that is the same as the Buddha.

source: ཆོས་དབྱིངས་མཉམ་པའི་དབྱིངས་ལ་རབ་ཏུ་ཞུགས། །
en: “You reside in the realm that is equal to the realm of phenomena.

source: ཆོས་རྣམས་ཐམས་ཅད་དངོས་པོར་འཇུག་མ་མཆིས། །དངོས་དང་དངོས་མེད་ཆགས་བྲལ་ཆགས་མཉམ་པ། །
en: You do not consider phenomena to be actual things, And you have no attachment to things or non-things; all attachment is equalized.

source: འགྲོ་བའི་དོན་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you who benefits beings!

source: གདུགས་དང་དགུང་ཟླ་དོག་སར་ལྷུང་ཡང་གདའ། །
en: “It is possible that the sun and moon could fall into a gorge.

source: བསེར་མ་ཞགས་པས་བཟུང་དུ་རུང་ཡང་གདའ། །
en: It could also happen that the wind is caught with a lasso.

source: རི་རྒྱལ་ཁ་ཡི་དབུགས་ཀྱིས་གཏོར་དུ་རུང་། །
en: Likewise, the king of mountains could be toppled with a breath.

source: རྒྱལ་བའི་གསུང་ནི་ལོག་པར་གསུང་མི་མངའ། །
en: Yet, the victors could never speak falsely.

source: ཡང་དག་ཁོ་ན་གསུང་ཅན་ཡོངས་སུ་དག །ཐུགས་དག་ནམ་མཁའ་འདྲ་བའི་ཐུགས་མངའ་བ། །འཇིག་རྟེན་ཆོས་དང་རྙེད་དང་སྲེད་པ་བསལ། །
en: “Possessing the true speech of thatness, absolutely pure, And a mind that is pure, like space, You dispel worldly concerns, hopes for gain, and craving.

source: པད་མ་ལྟ་བུར་སྲིད་གསུམ་ཆགས་མི་མངའ། །
en: Like a lotus, you are unattached to the three realms of existence.

source: བསྔགས་པའི་ཕྲེང་བ་གསན་ཀྱང་དགྱེས་མི་འགྱུར། །
en: “Hearing effulgent praise, you are not gladdened.

source: སྨད་པ་གསན་ཀྱང་ཞེ་སྡང་ཡོང་མི་མངའ། །
en: Hearing blame, you are not angered.

source: རི་རབ་ལྟ་བུར་ཡོངས་སུ་རྟོག་ལས་གྲོལ། །
en: You are freed from concept, like Mount Meru.

source: འགྲོ་ལ་བདེ་སྩལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you who brings happiness to beings!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After praising the Blessed One with these verses, the bodhisattva great beings said to the Blessed One,

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་རིན་པོ་ཆེ་བྱུང་བའོ། །
en: “Blessed One, the appearance of a buddha is like the appearance of a gem.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་བདེན་པ་བྱུང་བའོ། །དྲན་པ་བྱུང་བའོ། །བློ་གྲོས་བྱུང་བའོ། །རྟོགས་པ་བྱུང་བའོ། །ངོ་ཚ་ཤེས་པ་བྱུང་བའོ། །མོས་པ་བྱུང་བའོ། །སྦྱིན་པ་བྱུང་བའོ། །ཚུལ་ཁྲིམས་བྱུང་བའོ། །བཟོད་པ་བྱུང་བའོ། །བརྩོན་འགྲུས་བྱུང་བའོ། །བསམ་གཏན་བྱུང་བའོ། །ཤེས་རབ་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of truth, mindfulness, intelligence, realization, conscience, aspiration, generosity, discipline, patience, diligence, concentration, and insight.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་བྱམས་པ་བྱུང་བའོ། །སྙིང་རྗེ་བྱུང་བའོ། །དགའ་བ་བྱུང་བའོ། །བཏང་སྙོམས་བྱུང་བའོ། །དོན་བྱུང་བའོ། །བདེ་བ་བྱུང་བའོ། །ཆོས་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of love, compassion, joy, equanimity, meaning, happiness, and the Dharma.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་ཡང་དག་པར་དགའ་བར་འགྱུར་བའི་ཆོས་བྱུང་བའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་བྱུང་བའོ། །ཡང་དག་པར་སྤོང་བ་བྱུང་བའོ། །རྫུ་འཕྲུལ་གྱི་རྐང་པ་བྱུང་བའོ། །དབང་པོ་བྱུང་བའོ། །སྟོབས་བྱུང་བའོ། །བྱང་ཆུབ་ཀྱི་ཡན་ལག་བྱུང་བའོ། །ལམ་བྱུང་བའོ། །ཞི་གནས་བྱུང་བའོ། །ལྷག་མཐོང་བྱུང་བའོ། །མངོན་པར་ཤེས་པ་བྱུང་བའོ། །རིག་པ་བྱུང་བའོ། །རྣམ་པར་གྲོལ་བ་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of Dharma that brings joy, the applications of mindfulness, the right abandonments, the bases of miracles, the faculties, the strengths , the branches of awakening, the path, tranquility, special insight, super-knowledge, knowledge, and liberation.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བ་དང་དགེ་བའི་ཆོས་ཐམས་ཅད་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of all virtuous qualities and the abandonment of all nonvirtuous qualities.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་བརྩེགས་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the bodhisattva great being Prajñākūṭa, who was among the retinue, said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུང་བའི་དོན་ཇི་ལྟར་བདག་གིས་འཚལ་བ་ལྟར་ན་བདག་འདི་སྙམ་བགྱིད་དེ། བཅོམ་ལྡན་འདས་འདི་ལྟར་སངས་རྒྱས་བྱུང་བ་ནི་འཇིག་ཚོགས་ལ་ལྟ་བ་བྱུང་བའོ། །
en: “As I understand what the Blessed One has just said, then, Blessed One, the appearance of a buddha is the manifestation of the view of the transitory collection.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་མ་རིག་པ་དང་སྲིད་པ་དང་སྲེད་པ་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of ignorance, craving, and becoming.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of attachment, aggression, and stupidity.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་ཕྱིན་ཅི་ལོག་བཞི་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of the four errors.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་སྒྲིབ་པ་ལྔ་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of the five obscurations.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་སྐྱེ་མཆེད་དྲུག་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of the six sense sources.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་རྣམ་པར་ཤེས་པའི་གནས་བདུན་བྱུང་བའོ། །ལོག་པ་ཉིད་བརྒྱད་བྱུང་བའོ། །གནོད་པའི་དངོས་པོ་དགུ་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of the seven bases of consciousness, the eight wrong modes, and the nine things that harm.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་བྱུང་བའོ། །
en: Blessed One, the appearance of a buddha is the manifestation of the ten nonvirtuous deeds.

source: བཅོམ་ལྡན་འདས་སྡིག་པ་མི་དགེ་བའི་ཆོས་དེ་དག་སྤང་བའི་སླད་དུ་སངས་རྒྱས་བྱུང་བ་ལགས་ཀྱི་བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་གཉེན་པོས་རབ་ཏུ་ཕྱེ་བ་ནི་མ་ལགས་ཏེ།
en: Blessed One, a buddha manifests in order to remove these nonvirtuous, evil phenomena. However, Blessed One, the appearance of a buddha is not characterized by antidotes.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་གཉེན་པོ་མ་མཆིས་པ་གཉེན་པོ་དང་བྲལ་བའོ། །
en: Blessed One, the appearance of a buddha does not involve any antidotes and is void of antidotes.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བ་ནི་རྗེས་སུ་མཆི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྗེས་སུ་འགྲོ་བ་མ་མཆིས་པའི་ཚུལ་གྱིས་དེ་ལྟར་སངས་རྒྱས་བྱུང་བའི་རྗེས་སུ་མཆི་བར་བགྱིའོ། །
en: Blessed One, bodhisattvas who follow the appearance of a buddha do so in the manner of not following. That is how they follow the appearance of a buddha.”

source: རྗེས་སུ་འགྲོ་བ་མེད་པའི་ཚུལ་གྱིས་སངས་རྒྱས་བྱུང་བའི་རྗེས་སུ་འགྲོ་བར་བྱ་སྟེ།
en: One should follow the appearance of a buddha in the manner of not following.

source: སངས་རྒྱས་བྱུང་བ་ལ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཐམས་ཅད་བྱུང་བའི་རྗེས་སུ་འགྲོ་བར་བྱའོ། །
en: Just as one follows the appearance of a buddha, one should follow the appearance of any phenomena.”

source: བཅོམ་ལྡན་འདས་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ནི་སངས་རྒྱས་འབྱུང་བ་འདི་ལྟ་བུ་འདི་མ་འཚལ་ན།
en: “Blessed One, if novice bodhisattvas do not understand this fact about the appearance of a buddha, do they even perceive the appearance of any buddhas, Blessed One?”

source: བཅོམ་ལྡན་འདས་དེ་དག་ལ་སངས་རྒྱས་འབྱུང་བ་ལྟ་མཆིས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་ཇི་ལྟར་སེམས་ཡོངས་སུ་དག་པ་བཞིན་དུ་དེ་དག་ལ་ཡང་སངས་རྒྱས་འབྱུང་ངོ་། །
en: “Sāgaramati, buddhas occur to the degree that one’s mind is pure,” answered the Blessed One.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བཞི་པོ་འདི་དག་སྟེ།
en: Sāgaramati, there are four types of bodhisattvas.

source: འདི་ལྟ་སྟེ། སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྱོད་པ་ལ་ཞུགས་པ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྟེ།
en: They are: bodhisattvas who are just giving rise to the mind of awakening, those engaged in conduct, those who are irreversibly destined for awakening, and bodhisattvas in their last life.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་བཞི་པོ་དེ་དག་གོ། །
en: Sāgaramati, those are the four types of bodhisattvas.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དེས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་གཟུགས་དང་མཚན་དུ་མཐོང་ངོ་། །
en: “Sāgaramati, bodhisattvas who are just giving rise to the mind of awakening see the Thus-Gone One in terms of form and physical marks.

source: སྤྱོད་པ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དེས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཏན་ཡོངས་སུ་གྲུབ་པར་མཐོང་ངོ་། །
en: Bodhisattvas who are engaged in conduct see the Thus-Gone One as the manifestation of qualities.

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དེས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བར་མཐོང་ངོ་། །
en: Bodhisattvas who are irreversibly destined for awakening see the Thus-Gone One as characterized by the Dharma body.

source: བློ་གྲོས་རྒྱ་མཚོ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དེས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་གཟུགས་དང་མཚན་དང་ཡོན་ཏན་ཡོངས་སུ་གྲུབ་པ་དང་སྐྱེ་བ་དང་རིགས་དང་རུས་དང་། ཆོས་ཉིད་དུ་ཁས་མི་ལེན་ཏོ། །
en: Sāgaramati, bodhisattvas in their last life do not assert the Thus-Gone One to be a manifestation of form, physical marks, qualities, class, caste, family lineage, or reality.

source: དེའི་མིག་ནི་ཤེས་རབ་ཀྱིས་རྣམ་པར་ལྟ་བའོ། །
en: Their eyes see with insight.

source: ཤེས་རབ་ལ་གནས་པའོ། །
en: They are grounded in insight.

source: ཤེས་རབ་ཏུ་ཡང་དག་པར་འདུ་བའོ། །
en: They have merged with insight.

source: ཤེས་རབ་ཀྱང་རྒྱུ་བ་མེད་པ་སྤྲོས་པ་མེད་པ་སྟེ།
en: Their insight is unmoving and nonconceptual.

source: དེ་ནི་མཐོང་བ་ཡང་མ་ཡིན་མི་མཐོང་བ་ཡང་མ་ཡིན་ནོ། །
en: It is neither seeing nor non-seeing.

source: མཐོང་བ་དང་མི་མཐོང་བ་དེ་གཉི་ག་ཡང་མཐའ་སྟེ།
en: Both seeing and non-seeing are extremes.

source: མཐོང་བ་དང་མ་མཐོང་བའི་མཐའ་གཉིས་དང་བྲལ་བ་ནི་སངས་རྒྱས་མཐོང་བའོ། །
en: Being free from the two extremes of seeing and non-seeing is to see the Buddha.

source: གང་སངས་རྒྱས་མཐོང་བ་དེ་བདག་མཐོང་བ་སྟེ།
en: Seeing the Buddha is to see the self.

source: བདག་མཐོང་བ་རྣམ་པར་དག་པས་སངས་རྒྱས་མཐོང་བ་རྣམ་པར་དག །
en: With pure vision of the self, one attains pure vision of the Buddha.

source: སངས་རྒྱས་མཐོང་བ་རྣམ་པར་དག་པས་ཆོས་ཐམས་ཅད་མཐོང་བ་རྣམ་པར་དག་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: With pure vision of the Buddha, one must gain pure vision of all phenomena.

source: གང་མཐོང་བ་རྣམ་པར་དག་པ་དེ་ལ་ཡེ་ཤེས་མཐོང་བ་
en: When whatever is seen is pure, that is wisdom vision.

source: འདི་ནི་སངས་རྒྱས་མཐོང་བ་ཞེས་བྱའོ། །
en: That is called seeing the Buddha.

source: བློ་གྲོས་རྒྱ་མཚོ་ངས་ཀྱང་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེ་ལྟར་མཐོང་སྟེ།
en: “Sāgaramati, this is how I saw the Thus-Gone Dīpaṃkara.

source: མཐོང་མ་ཐག་ཏུ་ངས་ཐོབ་པ་མེད་པ་དང་མི་དམིགས་པའི་ཚུལ་གྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: As soon as I saw him, I attained the acceptance that phenomena are unborn in the manner of non-attainment and non-observation.

source: བཟོད་པ་ཐོབ་མ་ཐག་ཏུ་ངས་ལས་ཤིང་ཏ་ལ་བདུན་ཙམ་དུ་འཕགས་ཏེ
en: As soon as I attained that acceptance, I floated upwards to the height of seven palm trees.

source: ང་ནམ་མཁའི་དཀྱིལ་དེ་ལ་གནས་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་འབྱོར་པ་ལ་རྣམ་པར་བརྟགས།
en: While present in the midst of space, I considered the endowment of omniscient wisdom.

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་ཡང་དག་པར་ཆད།
en: All views ended.

source: རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དང་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་ཤིང་རྣམ་པར་ཤེས་པ་ཡུལ་ཐམས་ཅད་ལ་མི་གནས་ཏེ་ཏིང་ངེ་འཛིན་དྲུག་ཁྲི་མངོན་སུམ་དུ་གྱུར་ནས།
en: I transcended all thoughts, concepts, and notions, and my consciousness no longer dwelled on any objects. I actualized sixty thousand absorptions.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེས་ང་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན།
en: The blessed thus-gone Dīpaṃkara then gave the following prophecy:

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། །
en: ‘Young brahmin, in the future you will become the thus-gone, worthy, perfect buddha Śākyamuni.’
